# 324_homework5
# Криптографическая хеш-функция

Реализация криптографической хеш-функции на Python с улучшенными примесями для генерации 256-битных хешей.

## 📚 Описание алгоритма

В этой реализации используется специально разработанная хеш-функция, которая применяет сложные примеси и несколько раундов преобразований, чтобы создать уникальный хеш для любого входного сообщения.

### 🔐 Генерация хеша:
1. **Входные данные:** Преобразуются в байтовый формат.
2. **Инициализация состояния:** Начальный хеш состояния инициализируется с чередующимися байтами.
3. **Основная обработка:** Каждый байт входных данных используется для создания сложных смешиваний с использованием констант и математических операций.
4. **Диффузия:** Применяются дополнительные раунды для улучшения рассеяния значений и увеличения безопасности.
5. **Результат:** Генерируется 256-битный хеш.

### ✉️ Хеширование:
Для каждого байта данных выполняются операции перемешивания и XOR с различными значениями состояния и дополнительными параметрами.

### 🔓 Декодирование хеша:
Хеш-функция не является обратимой. Однако, при одинаковых входных данных всегда будет генерироваться один и тот же хеш.

## 💡 Пример использования

```python
from hash_function import generate_digest, _DIGEST_SIZE
import os

# Пример данных для хеширования
data = b"Hello, Cryptography!"

# Генерация хеша
digest = generate_digest(data)

# Вывод хеша
print("Digest:", digest.hex())
print("Digest Length:", len(digest), "bytes")
```

### Генерация хеша
```python
digest = generate_digest(b"Hello, World!")
print(f"Digest: {digest.hex()}")
```

### Пример демонстрации
```python
test_cases = [
    b"Cryptographic hash example",
    b"",
    b"Short",
    b"Long string " * 20,
    b"Special \x00\xFF bytes",
    os.urandom(1024),
    "This will cause error"  # Неверный тип данных
]

for case in test_cases:
    demonstrate_hashing(case if isinstance(case, bytes) else case.encode())
```

## Особенности реализации
- Реализована хеш-функция с использованием кастомных примесей и многократных раундов перемешивания.
- Входные данные проверяются на корректность (необходимо передавать данные в формате байтов).
- Поддержка случайных данных (например, генерация случайных байтов с помощью `os.urandom()`).
- Демонстрация работы с различными типами данных (строки, пустые данные, случайные данные).

## Ограничения
- Не рекомендуется для промышленного использования (это экспериментальный алгоритм).
- Могут быть ограничения на размер данных в зависимости от их обработки в памяти.

## Требования

- Python 3.x

## Установка

Для начала работы с проектом просто склонируйте репозиторий или загрузите файлы.

### Командная строка
Запустите тесты:
```bash
python -m unittest test_hash_function.py
```

### Структура проекта
hash_function.py         # Основная реализация хеш-функции  
test_hash_function.py    # Юнит-тесты  
README.md                # Инструкция по сборке и использованию  
